# **Pandas**
___

In [ ]:
# instalar las librerias para este jupyter
! pip install pandas
! pip install numpy

In [14]:
# imports para trabajar con DataFrames
import pandas as pd
import numpy as np

### DataFrame

In [ ]:
data = {"state": ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# creaar el DataFrame
frame = pd.DataFrame(data)
# mostrarlo desde jupyter
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

* Operaciones b√°sicas con DataFrames

In [15]:
# muestra solo la cavezera del DataFrame, le puedo pasar cuantos registros desde el principio (10)
frame.head(10)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
# cambiar el orden de las columnas del DataFrame
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [17]:
# cambiar el indice del DataFrame con index y si agregamos mas columnas pone valores por defecto NaN
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', "debt"],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [18]:
# muestra las columnas del DataFrame
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [19]:
# para mostrar solo una columna del DataFrame
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [20]:
# para ponerle valores a una columna del DataFrame
frame2["debt"] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [21]:
# cambiar los valores con una funcion de numpy
frame2["debt"] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [23]:
# con frame2.index.size tenemos la cantidad de filas del DataFrame
# con np.arange(6) agregamos de a uno en cada fila
frame3 = pd.DataFrame(frame, columns=['year', 'state', 'pop'], index=np.arange(frame.index.size))
frame3

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2